saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.9.0.pdsc
          <book name="Documents/MKW40Z160.pdf"   title="MKW40Z/30Z/20Z Data Sheet"/>
          <book name="Documents/MKW40Z160RM.pdf" title="MKW40Z/30Z/20Z Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW31Z  ****************************** -->
      <subFamily DsubFamily="KW31Z">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book    name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <description>
The KW31Z is an ultra low-power, highly-integrated single-chip device that enables Bluetooth® Smart/Bluetooth® Low Energy (BLE) v4.2 RF connectivity for portable, extremely low-power embedded systems.
Applications include portable health care devices, wearable sports and fitness devices, AV remote controls, computer keyboards and mice, gaming controllers, access control security systems, smart energy and home area networks.
The KW31Z Wireless MCU integrates a 2.4 GHz transceiver supporting FSK/GFSK modulations, an ARM® Cortex®-M0+ CPU, up to 512 KB Flash and up to 128 KB SRAM, BLE Link Layer hardware, hardware security and peripherals optimized to meet the requirements of the target applications.
        </description>

        <!-- ******************************  MKW31Z256xxx4  ***************************** -->
        <device Dname="MKW31Z256xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW31Z4.h" define="MKW31Z256xxx4"/>
          <debug svd="SVD/MKW31Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW41Z512.pdf"   title="MKW41Z/31Z/21Z Data Sheet"/>
          <book name="Documents/MKW41Z512RM.pdf" title="MKW41Z/31Z/21Z Reference Manual"/>
        </device>

        <!-- ******************************  MKW31Z512xxx4  ***************************** -->
        <device Dname="MKW31Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW31Z4.h" define="MKW31Z512xxx4"/>
          <debug svd="SVD/MKW31Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW41Z512.pdf"   title="MKW41Z/31Z/21Z Data Sheet"/>
          <book name="Documents/MKW41Z512RM.pdf" title="MKW41Z/31Z/21Z Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW40Z  ****************************** -->
      <subFamily DsubFamily="KW40Z">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book    name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>
        <description>
The KW40Z is a highly-integrated single-chip device that enables Bluetooth® Smart/Bluetooth® Low Energy (BLE) v4.1 and IEEE® 802.15.4-2011 RF connectivity for portable, extremely low-power embedded systems.
Applications include portable health care devices, wearable sports and fitness devices, AV remote controls, computer keyboards and mice, gaming controllers, access control, security systems, smart energy and home area networks.
The KW40Z MCU integrates a 2.4 GHz transceiver supporting a range of FSK/GFSK and O-QPSK modulations, an ARM® Cortex®-M0+ CPU, 160 KB Flash and 20 KB SRAM, BLE Link Layer hardware, 802.15.4 packet processor, hardware security and peripherals optimized to meet the requirements of the target applications.
The KW40Z has enough on-chip memory to concurrently run both a Bluetooth Low Energy stack and an IEEE 8021.5.4 MAC/PHY for multi-mode applications.
        </description>

        <!-- ******************************  MKW40Z160xxx4  ***************************** -->
        <device Dname="MKW40Z160xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW40Z4.h" define="MKW40Z160xxx4"/>
          <debug svd="SVD/MKW40Z4.svd"/>
          <memory id="IROM1"                        start="0x00000000" size="0x00028000" default="1" startup="1"/>
          <memory id="IRAM1"                        start="0x1FFFF000" size="0x00005000" default="1" init   ="0"/>
          <algorithm name="Flash/MK_P160_48MHZ.FLM" start="0x00000000" size="0x00028000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW40Z160.pdf"   title="MKW40Z/30Z/20Z Data Sheet"/>
          <book name="Documents/MKW40Z160RM.pdf" title="MKW40Z/30Z/20Z Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW41Z  ****************************** -->
      <subFamily DsubFamily="KW41Z">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book    name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>
        <description>
The KW41Z is an ultra low-power, highly-integrated single-chip device that enables Bluetooth® Smart/Bluetooth® Low Energy (BLE) v4.2 and IEEE® 802.15.4-2011 RF connectivity for portable, extremely low-power embedded systems.
Applications include portable health care devices, wearable sports and fitness devices, AV remote controls, computer keyboards and mice, gaming controllers, access control security systems, smart energy and home area networks.
The KW41Z MCU integrates a 2.4 GHz transceiver supporting FSK/GFSK and O-QPSK modulations, an ARM® Cortex®-M0+ CPU, up to 512 KB Flash and up to 128 KB SRAM, 802.15.4 packet processor, hardware security and peripherals optimized to meet the requirements of the target applications.
The KW41Z is an ideal solution for true single chip designs that require concurrent communication on both a Bluetooth Low Energy network and an 802.15.4 based network such as Thread or ZigBee.
This multi-mode capability enables direct communication using Bluetooth Low Energy via a mobile device and participating in a mesh network for local and remote control/monitoring.
        </description>

