saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.9.0.pdsc
        <!-- ******************************  MKW41Z256xxx4  ***************************** -->
        <device Dname="MKW41Z256xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW41Z4.h" define="MKW41Z256xxx4"/>
          <debug svd="SVD/MKW41Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW41Z512.pdf"   title="MKW41Z/31Z/21Z Data Sheet"/>
          <book name="Documents/MKW41Z512RM.pdf" title="MKW41Z/31Z/21Z Reference Manual"/>
        </device>

        <!-- ******************************  MKW41Z512xxx4  ***************************** -->
        <device Dname="MKW41Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/Include/MKW41Z4.h" define="MKW41Z512xxx4"/>
          <debug svd="SVD/MKW41Z4.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                              start="0x1FFF8000" size="0x00020000" default="1" init   ="0"/>
          <algorithm name="Flash/MKWxxZ_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x1000"/>

          <book name="Documents/MKW41Z512.pdf"   title="MKW41Z/31Z/21Z Data Sheet"/>
          <book name="Documents/MKW41Z512RM.pdf" title="MKW41Z/31Z/21Z Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW35  ****************************** -->
      <subFamily DsubFamily="KW35">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book    name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>
        <description>
The KW35/36 devices, which include KW35 and KW36 both Automotive and Industrial, are highly integrated single-chip devices that enable Bluetooth low energy (BLE) and Generic FSK connectivity for automotive and industrial embedded systems. 
The applications center on bridging the embedded world with smartphones to enhance the human interface experience, share embedded data with the cloud, or enable wireless firmware updates. 
Leading the automotive applications is the Digital Key where the smartphone not only can be used as an alternative to the key FOB for unlocking and personalizing the driving experience but also to provide select and authorized access when a key is not needed like you might see in car sharing.        </description>

        <!-- ******************************  MKW35A512xxx4  ***************************** -->
        <device Dname="MKW35A512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/MKW35A4/Include/MKW35A4.h" define="MKW35A512xxx4"/>
          <debug svd="SVD/MKW35A4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/KW36x_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x2000"/>

          <book name="Documents/MKW36A512.pdf"   title="MKW35/36 Data Sheet"/>
          <book name="Documents/MKW36A512RM.pdf" title="MKW35/36 Reference Manual"/>
        </device>

        <!-- ******************************  MKW35Z512xxx4  ***************************** -->
        <device Dname="MKW35Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/MKW35Z4/Include/MKW35Z4.h" define="MKW35Z512xxx4"/>
          <debug svd="SVD/MKW35Z4.svd"/>
          <memory id="IROM1"                             start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IRAM1"                             start="0x1FFFC000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/KW36x_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" default="1" RAMstart="0x20000000" RAMsize="0x2000"/>

          <book name="Documents/MKW36Z512.pdf"   title="MKW35/36 Data Sheet"/>
          <book name="Documents/MKW36A512RM.pdf" title="MKW35/36 Reference Manual"/>
        </device>
      </subFamily>

      <!-- ******************************  KW36  ****************************** -->
      <subFamily DsubFamily="KW36">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0"/>
        <book    name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf"     title="Cortex-M0+ Generic User Guide"/>
        <description>
The KW35/36 devices, which include KW35 and KW36 both Automotive and Industrial, are highly integrated single-chip devices that enable Bluetooth low energy (BLE) and Generic FSK connectivity for automotive and industrial embedded systems. 
The applications center on bridging the embedded world with smartphones to enhance the human interface experience, share embedded data with the cloud, or enable wireless firmware updates. 
Leading the automotive applications is the Digital Key where the smartphone not only can be used as an alternative to the key FOB for unlocking and personalizing the driving experience but also to provide select and authorized access when a key is not needed like you might see in car sharing.        </description>

        <!-- ******************************  MKW36A512xxx4  ***************************** -->
        <device Dname="MKW36A512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/MKW36A4/Include/MKW36A4.h" define="MKW36A512xxx4"/>
          <debug svd="SVD/MKW36A4.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IROM2"                                  start="0x10000000" size="0x00040000" default="0" startup="0"/>
          <memory id="IRAM1"                                  start="0x1FFFC000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/KW36x_P256_2KB_SEC.FLM"      start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
          <algorithm name="Flash/KW36x_D256Alias_2KB_SEC.FLM" start="0x00040000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
          <algorithm name="Flash/KW36x_D256_2KB_SEC.FLM"      start="0x10000000" size="0x00040000" default="0" RAMstart="0x20000000" RAMsize="0x2000"/>

          <book name="Documents/MKW36A512.pdf"   title="MKW35/36 Data Sheet"/>
          <book name="Documents/MKW36A512RM.pdf" title="MKW35/36 Reference Manual"/>
        </device>

        <!-- ******************************  MKW36Z512xxx4  ***************************** -->
        <device Dname="MKW36Z512xxx4">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
          <compile header="Device/MKW36Z4/Include/MKW36Z4.h" define="MKW36Z512xxx4"/>
          <debug svd="SVD/MKW36Z4.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" default="1" startup="1"/>
          <memory id="IROM2"                                  start="0x10000000" size="0x00040000" default="0" startup="0"/>
          <memory id="IRAM1"                                  start="0x1FFFC000" size="0x00010000" default="1" init   ="0"/>
          <algorithm name="Flash/KW36x_P256_2KB_SEC.FLM"      start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
          <algorithm name="Flash/KW36x_D256Alias_2KB_SEC.FLM" start="0x00040000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x2000"/>
          <algorithm name="Flash/KW36x_D256_2KB_SEC.FLM"      start="0x10000000" size="0x00040000" default="0" RAMstart="0x20000000" RAMsize="0x2000"/>

