saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.Kinetis_KWxx_DFP.1.9.0.pdsc
        <!-- linker scripts -->
        <file category="linkerScript" name="Device/MKW35Z4/Source/arm/MKW35Z512xxx4_flash.scf"            attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW35Z4/Source/arm/MKW35Z512xxx4_flash_ram_vector.scf" attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW35Z4/Source/arm/MKW35Z512xxx4_ram.scf"              attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW35Z4/Source/arm/MKW35Z512xxx4_ram_ram_vector.scf"   attr="config" version="1.1.0" condition="ARMCC"/>

        <file category="linkerScript" name="Device/MKW35Z4/Source/gcc/MKW35Z512xxx4_flash.ld"             attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW35Z4/Source/gcc/MKW35Z512xxx4_flash_ram_vector.ld"  attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW35Z4/Source/gcc/MKW35Z512xxx4_ram.ld"               attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW35Z4/Source/gcc/MKW35Z512xxx4_ram_ram_vector.ld"    attr="config" version="1.1.0" condition="GCC"/>
     </files>
    </component>

    <!-- Startup MKW36A4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="MKW36A4_CMSIS">
      <description>System Startup for Kinetis KW35A 48MHz Devices</description>
      <files>
        <!-- include folders -->
        <file category="include"      name="Device/MKW36A4/Include/"/>

        <!-- startup files -->
        <file category="sourceAsm"    name="Device/MKW36A4/Source/arm/startup_MKW36A4.s"                  attr="config" version="1.3.0" condition="ARMCC"/>
        <file category="sourceC"      name="Device/MKW36A4/Source/gcc/startup_MKW36A4.S"                  attr="config" version="1.3.0" condition="GCC"/>

        <!-- system files -->
        <file category="sourceC"      name="Device/MKW36A4/Source/system_MKW36A4.c"                       attr="config" version="1.3.0"/>
        <file category="header"       name="Device/MKW36A4/Source/system_MKW36A4.h"                       attr="config" version="1.3.0"/>

        <!-- linker scripts -->
        <file category="linkerScript" name="Device/MKW36A4/Source/arm/MKW36A512xxx4_flash.scf"            attr="config" version="1.1.1" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW36A4/Source/arm/MKW36A512xxx4_flash_ram_vector.scf" attr="config" version="1.1.1" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW36A4/Source/arm/MKW36A512xxx4_ram.scf"              attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW36A4/Source/arm/MKW36A512xxx4_ram_ram_vector.scf"   attr="config" version="1.1.0" condition="ARMCC"/>

        <file category="linkerScript" name="Device/MKW36A4/Source/gcc/MKW36A512xxx4_flash.ld"             attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW36A4/Source/gcc/MKW36A512xxx4_flash_ram_vector.ld"  attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW36A4/Source/gcc/MKW36A512xxx4_ram.ld"               attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW36A4/Source/gcc/MKW36A512xxx4_ram_ram_vector.ld"    attr="config" version="1.1.0" condition="GCC"/>
     </files>
    </component>

    <!-- Startup MKW36Z4 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="MKW36Z4_CMSIS">
      <description>System Startup for Kinetis KW35Z 48MHz Devices</description>
      <files>
        <!-- include folders -->
        <file category="include"      name="Device/MKW36Z4/Include/"/>

        <!-- startup files -->
        <file category="sourceAsm"    name="Device/MKW36Z4/Source/arm/startup_MKW36Z4.s"                  attr="config" version="1.3.0" condition="ARMCC"/>
        <file category="sourceC"      name="Device/MKW36Z4/Source/gcc/startup_MKW36Z4.S"                  attr="config" version="1.3.0" condition="GCC"/>

        <!-- system files -->
        <file category="sourceC"      name="Device/MKW36Z4/Source/system_MKW36Z4.c"                       attr="config" version="1.3.0"/>
        <file category="header"       name="Device/MKW36Z4/Source/system_MKW36Z4.h"                       attr="config" version="1.3.0"/>

        <!-- linker scripts -->
        <file category="linkerScript" name="Device/MKW36Z4/Source/arm/MKW36Z512xxx4_flash.scf"            attr="config" version="1.1.1" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW36Z4/Source/arm/MKW36Z512xxx4_flash_ram_vector.scf" attr="config" version="1.1.1" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW36Z4/Source/arm/MKW36Z512xxx4_ram.scf"              attr="config" version="1.1.0" condition="ARMCC"/>
        <file category="linkerScript" name="Device/MKW36Z4/Source/arm/MKW36Z512xxx4_ram_ram_vector.scf"   attr="config" version="1.1.0" condition="ARMCC"/>

        <file category="linkerScript" name="Device/MKW36Z4/Source/gcc/MKW36Z512xxx4_flash.ld"             attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW36Z4/Source/gcc/MKW36Z512xxx4_flash_ram_vector.ld"  attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW36Z4/Source/gcc/MKW36Z512xxx4_ram.ld"               attr="config" version="1.1.0" condition="GCC"/>
        <file category="linkerScript" name="Device/MKW36Z4/Source/gcc/MKW36Z512xxx4_ram_ram_vector.ld"    attr="config" version="1.1.0" condition="GCC"/>
     </files>
    </component>

    <bundle Cbundle="FRDM-KW40Z" Cclass="Board Support" Cversion="1.0.0">
      <description>FRDM-KW40Z Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="MKW40Z4 CMSIS">
      <description>Button driver for NXP FRDM-KW40Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW40Z/Common/Buttons_FRDM-KW40Z.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="MKW40Z4 CMSIS">
      <description>LED driver for NXP FRDM-KW40Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW40Z/Common/LED_FRDM-KW40Z.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="FRDM-KW41Z" Cclass="Board Support" Cversion="1.0.0">
      <description>FRDM-KW41Z Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="MKW41Z4 CMSIS">
      <description>Button driver for NXP FRDM-KW41Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW41Z/Common/Buttons_FRDM-KW41Z.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="MKW41Z4 CMSIS">
      <description>LED driver for NXP FRDM-KW41Z board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW41Z/Common/LED_FRDM-KW41Z.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="FRDM-KW36" Cclass="Board Support" Cversion="1.0.0">
      <description>FRDM-KW36 Board Support</description>
      <doc></doc>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="MKW36x4_CMSIS">
      <description>Button driver for NXP FRDM-KW36 board</description>
        <files>
          <file category="source" name="Boards/NXP/FRDM-KW36/Common/Buttons_FRDM-KW36.c"/>
        </files>
      </component>
